let arr = [ "大众", "大众", "大众", "大众", "大众", "大众", "奥迪", "奥迪", "奥迪", "奥迪", "奥迪", "奥迪", "奥迪", "奥迪", "奥迪", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "宝马", "奔驰", "奔驰", "奔驰", "奔驰", "奔驰", "奔驰", "奔驰", "奔驰", "奔驰", "标致", "标致", "标致", "标致", "标致", "标致", "丰田", "丰田", "丰田", "丰田", "丰田", "丰田", "丰田", "丰田", "路虎", "MINI", "MINI", "MINI", "MINI", "MINI", "MINI", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "日产", "特斯拉", "特斯拉", "五菱", "五菱", "五菱", "五菱", "五菱", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "雪佛兰", "路虎", "路虎", "路虎", "路虎", ];

let set = new Set();
for ( var i = 0; i < arr.length; ++i ) {
  var obj = arr[ i ];
  set.add(obj);
}
// { then(onFulfill, onReject) { onFulfill("fulfilled!"); } }
console.log(set);
let brand  = [
  '大众',
  '奥迪',
  '宝马',
  '奔驰',
  '标致',
  '丰田',
  '路虎',
  'MINI',
  '日产',
  '特斯拉',
  '五菱',
  '雪佛兰',
];

let series = [
  '高尔夫',
  '帕萨特',
  'A6L',
  'Q5',
  'TT',
  '5系',
  '3系',
  'X5',
  'X6',
  'C级',
  'E级',
  'GLK级',
  '308',
  '408',
  '凯美瑞',
  '卡罗拉',
  '汉兰达',
  '发现',
  'Mini',
  'coupe',
  '天籁',
  '骐达',
  '逍客',
  'MODELS',
  'MODELX',
  '宏光',
  '科鲁兹',
  '迈锐宝',
];